---
kind: method
id: M:Autodesk.Revit.DB.Structure.Rebar.IsRebarFreeForm
zh: 钢筋、配筋
source: html/cf39a5b8-d7f3-d073-0120-358dd3afab21.htm
---
# Autodesk.Revit.DB.Structure.Rebar.IsRebarFreeForm Method

**中文**: 钢筋、配筋

Returns true if the rebar is free form and false if shape driven.

## Syntax (C#)
```csharp
public bool IsRebarFreeForm()
```

## Returns
Returns true if the rebar is free form and false if shape driven.